IDENTIFICATION DIVISION.
PROGRAM-ID. STRUCTUREDEMO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-MESSAGE PIC X(30) VALUE "This is a structured program.".

PROCEDURE DIVISION.
    DISPLAY WS-MESSAGE.
    STOP RUN.
