IDENTIFICATION DIVISION.
PROGRAM-ID. INPUTDEMO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-RAW-NAME     PIC X(20).
01 WS-STORED-NAME  PIC X(20).

PROCEDURE DIVISION.
    DISPLAY "ENTER YOUR NAME: ".
    ACCEPT WS-RAW-NAME.
    MOVE WS-RAW-NAME TO WS-STORED-NAME.
    DISPLAY "YOU ENTERED: " WS-STORED-NAME.
    STOP RUN.
