IDENTIFICATION DIVISION.
PROGRAM-ID. VARIABLEDEMO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME     PIC X(20) VALUE "ALICE".
01 WS-AGE      PIC 999   VALUE 27.
01 WS-SCORE    PIC 999   VALUE 095.

PROCEDURE DIVISION.
    DISPLAY "NAME  : " WS-NAME.
    DISPLAY "AGE   : " WS-AGE.
    DISPLAY "SCORE : " WS-SCORE.
    STOP RUN.
