       IDENTIFICATION DIVISION.
       PROGRAM-ID. STRING-DEMO.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CUSTOMER-NAME       PIC X(20) VALUE "ANA SILVA           ".
       01 WS-BALANCE             PIC 9(5)V99 VALUE 152340.
       01 WS-BALANCE-DISPLAY     PIC ZZ,ZZ9.99.

       PROCEDURE DIVISION.
           MOVE WS-BALANCE TO WS-BALANCE-DISPLAY
           DISPLAY "Customer: " WS-CUSTOMER-NAME
           DISPLAY "Balance : " WS-BALANCE-DISPLAY
           STOP RUN.
